julianoes/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
static void init_timer_config(uint32_t channel_mask)
{
	// Mark timers in use, channels in use, and timers for bidi dshot
	for (unsigned output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (channel_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;

			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

			if ((timer_channel <= 0) || (timer_channel >= 5)) {
				// invalid channel, only 1 - 4
				continue;
			}

			uint8_t timer_channel_index = timer_channel - 1;

			if (io_timers[timer_index].dshot.dma_base == 0) {
				// board does not configure dshot on this timer
				continue;
			}

			// NOTE: this is necessary to pass timer_index to DMA callback
			timer_configs[timer_index].timer_index = timer_index;
			// Mark timer as enabled
			timer_configs[timer_index].enabled = true;
			// Mark channel as enabled
			timer_configs[timer_index].enabled_channels[timer_channel_index] = true;

			// Mark timer as bidirectional
			if (_bidirectional) {
				timer_configs[timer_index].bidirectional = true;
			}
		}
	}
}

// Initializes dshot on configured timers if DShot mode is enabled and DMA is available.
static void init_timers_dma_up(void)
{
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled) {
			// timer is not enabled for dshot
			continue;
		}

		if (io_timers[timer_index].dshot.dma_map_up == 0) {
			// timer does not have DMA UP mapped
			continue;
		}

		// Attempt to allocate DMA for Burst
		timer_configs[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

		if (timer_configs[timer_index].dma_up_handle == NULL) {
			PX4_DEBUG("Failed to allocate Timer %u DMA UP", timer_index);
			continue;
		}

		PX4_DEBUG("Allocated DMA UP Timer Index %u", timer_index);
		timer_configs[timer_index].initialized = true;
	}

	// Free the allocated DMA channels
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].dma_up_handle != NULL) {
			stm32_dmafree(timer_configs[timer_index].dma_up_handle);
			timer_configs[timer_index].dma_up_handle = NULL;
			PX4_DEBUG("Freed DMA UP Timer Index %u", timer_index);
		}
	}
}

static void init_timers_dma_capt_comp()
{
	uint8_t num_timers_used = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
			continue;
		}
		++num_timers_used;
	}

	// If we use multiple timers, we need to split the available channels.
	uint8_t dma_per_timer = (uint8_t)BOARD_DMA_NUM_DSHOT_CHANNELS / num_timers_used;

	if (dma_per_timer < 1) {
		PX4_WARN("Not enough DMA channels available. DShot uses %d timers, DMA available: %d, DMA per timer: %d\n",
			 num_timers_used, BOARD_DMA_NUM_DSHOT_CHANNELS, dma_per_timer);
	}
	
	PX4_DEBUG("DShot uses %d timers, DMA available: %d, DMA per timer: %d\n",
		  num_timers_used, BOARD_DMA_NUM_DSHOT_CHANNELS, dma_per_timer);

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
			continue;
		}


		uint8_t dma_configured = 0;
		// Allocate DMA for each enabled channel
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

			if ((timer_channel <= 0) || (timer_channel >= 5)) {
				// invalid channel, only 1 - 4
				continue;
			}

			// For each enabled channel on this timer, try allocating DMA
			uint8_t timer_channel_index = timer_channel - 1;
			bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
			bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

			if (this_timer && channel_enabled) {
				uint32_t dma_map_ch = io_timers[timer_index].dshot.dma_map_ch[timer_channel_index];

				if (dma_map_ch == 0) {
					// Timer channel is not mapped
					PX4_WARN("Error! Timer %u Channel %u DMA is unmapped", timer_index, timer_channel_index);
					continue;
				}

				PX4_DEBUG("Allocating DMA CH for Timer Index %u Channel %u", timer_index, timer_channel_index);
				// Allocate DMA
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(dma_map_ch);

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
					PX4_WARN("Failed to allocate Timer %u Channel DMA CH %u, output_channel %u", timer_index, timer_channel_index,
						 output_channel);
					continue;
				}
				++dma_configured;

				PX4_DEBUG("Allocated DMA CH Timer Index %u Channel %u", timer_index, timer_channel_index);
				// Mark this timer channel as bidirectional
				timer_configs[timer_index].captcomp_channels[timer_channel_index] = true;

				if (dma_configured >= dma_per_timer) {
					PX4_INFO("Limiting DMA channels to %u", dma_per_timer);
					timer_configs[timer_index].num_dma_available = dma_per_timer;
					break;
				}
			}
		}

		// De-allocate DMA for each channel
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
			if (timer_index == timer_io_channels[output_channel].timer_index) {

				uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

				if ((timer_channel <= 0) || (timer_channel >= 5)) {
					// invalid channel, only 1 - 4
					continue;
				}

				uint8_t timer_channel_index = timer_channel - 1;

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index]) {
					stm32_dmafree(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
					timer_configs[timer_index].dma_ch_handle[timer_channel_index] = NULL;
					PX4_DEBUG("Freed DMA CH Timer Index %u Channel %u", timer_index, timer_channel_index);
				}
			}
		}
	}

}

static int32_t init_timer_channels(uint8_t timer_index)
{
	int32_t channels_init_mask = 0;

	if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
		// timer is not enabled or could not be initialized
		return 0;
	}

	io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted :
				       IOTimerChanMode_Dshot;

