julianoes/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

		if ((timer_channel <= 0) || (timer_channel >= 5)) {
			// invalid channel, only 1 - 4
			continue;
		}

		uint8_t timer_channel_index = timer_channel - 1;
		bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

		if (this_timer && channel_enabled) {
			int ret = io_timer_channel_init(output_channel, mode, NULL, NULL);

			if (ret != OK) {
				PX4_WARN("io_timer_channel_init %u failed", output_channel);
				continue;
			}

			timer_configs[timer_index].initialized_channels[timer_channel_index] = true;
			channels_init_mask |= (1 << output_channel);

			if (timer_configs[timer_index].bidirectional) {
				PX4_DEBUG("DShot initialized OutputChannel %u (bidirectional)", output_channel);

			} else {
				PX4_DEBUG("DShot initialized OutputChannel %u", output_channel);
			}
		}
	}

	return channels_init_mask;
}

int up_dshot_init(uint32_t channel_mask, unsigned dshot_pwm_freq, bool enable_bidirectional_dshot)
{
	_dshot_frequency = dshot_pwm_freq;
	_bidirectional = enable_bidirectional_dshot;

	if (_bidirectional) {
		PX4_INFO("Bidirectional DShot enabled");
	}

	// Initialize timer_config data based on enabled channels
	init_timer_config(channel_mask);

	// Initializes dshot on each timer if DShot mode is enabled and DMA is available
	init_timers_dma_up();

	// Initializes a single timer in Bidirectional DShot mode
	if (_bidirectional) {
		init_timers_dma_capt_comp();
	}

	int32_t channels_init_mask = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		channels_init_mask |= init_timer_channels(timer_index);
	}

	unsigned output_buffer_offset = 0;

	for (unsigned timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].initialized) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[output_buffer_offset];

#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			output_buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (output_buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	return channels_init_mask;
}

// Kicks off a DMA transmit for each configured timer and the associated channels
void up_dshot_trigger()
{
	//counter++;

	// Enable DShot inverted on all channels
	io_timer_set_enable(true, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
			    IO_TIMER_ALL_MODES_CHANNELS);

	//static unsigned counter = 0;
	//bool print = (counter++ % 499 == 0);

	// For each timer, begin DMA transmit
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].enabled && timer_configs[timer_index].initialized) {

			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;

			io_timer_set_dshot_burst_mode(timer_index, _dshot_frequency, channel_count);

			// Allocate DMA
			if (timer_configs[timer_index].dma_up_handle == NULL) {
				timer_configs[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

				if (timer_configs[timer_index].dma_up_handle == NULL) {
					PX4_WARN("DMA allocation for timer %u failed", timer_index);
					continue;
				}
			}

			// Flush cache so DMA sees the data
			up_clean_dcache((uintptr_t) dshot_output_buffer[timer_index],
					(uintptr_t) dshot_output_buffer[timer_index] +
					DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

			px4_stm32_dmasetup(timer_configs[timer_index].dma_up_handle,
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
					   (uint32_t)(dshot_output_buffer[timer_index]),
					   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
					   DSHOT_DMA_SCR);

			// Clean UDE flag before DMA is started
			io_timer_update_dma_req(timer_index, false);

			// Trigger DMA (DShot Outputs)
			if (timer_configs[timer_index].bidirectional) {
				//if (print) {
				//	printf("handle: 0x%lx\n", (long unsigned)timer_configs[timer_index].dma_up_handle);
				//}
				stm32_dmastart(timer_configs[timer_index].dma_up_handle, dma_burst_finished_callback,
					       &timer_configs[timer_index].timer_index,
					       false);

			} else {
				stm32_dmastart(timer_configs[timer_index].dma_up_handle,  NULL, NULL, false);
			}

			// Enable DMA update request
			io_timer_update_dma_req(timer_index, true);
		}
	}
}

//static void configure_channels_round_robin(uint8_t timer_index)
//{
//	return;
//	switch (timer_configs[timer_index].num_dma_available) {
//	case 1: {
//			for (uint8_t i = 0; i < MAX_NUM_CHANNELS_PER_TIMER; i++) {
//				if (timer_configs[timer_index].captcomp_channels[i]) {
//					timer_configs[timer_index].captcomp_channels[i] = false;
//
//					if (i == 3) {
//						timer_configs[timer_index].captcomp_channels[0] = true;
//
//					} else {
//						timer_configs[timer_index].captcomp_channels[i + 1] = true;
//					}
//
//					break;
//				}
//			}
//
//			break;
//		}
//
//	case 2: {
//			if (timer_configs[timer_index].captcomp_channels[0]) {
//				timer_configs[timer_index].captcomp_channels[0] = false;
//				timer_configs[timer_index].captcomp_channels[1] = true;
//				timer_configs[timer_index].captcomp_channels[2] = false;
//				timer_configs[timer_index].captcomp_channels[3] = true;
//
//			} else {
//				timer_configs[timer_index].captcomp_channels[0] = true;
//				timer_configs[timer_index].captcomp_channels[1] = false;
//				timer_configs[timer_index].captcomp_channels[2] = true;
//				timer_configs[timer_index].captcomp_channels[3] = false;
//			}
//
//			break;
//		}
//
//	case 3: {
//			for (uint8_t i = 0; i < MAX_NUM_CHANNELS_PER_TIMER; i++) {
//				if (!timer_configs[timer_index].captcomp_channels[i]) {
//					timer_configs[timer_index].captcomp_channels[i] = true;
//
//					if (i == 3) {
//						timer_configs[timer_index].captcomp_channels[0] = false;
//
//					} else {
//						timer_configs[timer_index].captcomp_channels[i + 1] = false;
//					}
//
//					break;
//				}
//			}
//
//			break;
//		}
//
//	default:
//		break;
//	}
//}

