julianoes/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
void dma_burst_finished_callback(DMA_HANDLE handle, uint8_t status, void *arg)
{
	//bool print = (counter % 499 == 0);

	uint8_t timer_index = *((uint8_t *)arg);

	// Clean DMA UP configuration
	if (timer_configs[timer_index].dma_up_handle != NULL) {
		stm32_dmastop(timer_configs[timer_index].dma_up_handle);
		stm32_dmafree(timer_configs[timer_index].dma_up_handle);
		timer_configs[timer_index].dma_up_handle = NULL;
	}

	// Disable DMA update request
	io_timer_update_dma_req(timer_index, false);

	// De-allocate timer
	io_timer_unallocate_timer(timer_index);

	// Flush cache so DMA sees the data
	memset(dshot_capture_buffer, 0, sizeof(dshot_capture_buffer));
	up_clean_dcache((uintptr_t) dshot_capture_buffer,
			(uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));


	// If round robin is enabled reconfigure which channels we capture on
	//configure_channels_round_robin(timer_index);

	// Allocate DMA for all enabled channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

		if ((timer_channel <= 0) || (timer_channel >= 5)) {
			// invalid channel, only 1 - 4
			continue;
		}

		uint8_t timer_channel_index = timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];
		bool captcomp_enabled = timer_configs[timer_index].captcomp_channels[timer_channel_index];

		if (is_this_timer && channel_initialized && captcomp_enabled) {

			//if (print) printf("----\nunalloc output %d\n", output_channel);
			//if (print) printf("before 0x%lx\n", (long unsigned)timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
			// Re-initialize output for CaptureDMA
			io_timer_unallocate_channel(output_channel);
			io_timer_channel_init(output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);


			// Allocate DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(
							io_timers[timer_index].dshot.dma_map_ch[timer_channel_index]);

				//if (print) printf(", set up dma 0x%lx", (long unsigned)timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
			} else {
				//if (print) printf(", still 0x%lx", (long unsigned)timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
			}
			//if (print) printf("\n");

			// If DMA handler is valid, start DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				PX4_WARN("failed to allocate dma for timer %u channel %u", timer_index, timer_channel_index);
				return;
			}

			// Set Capture mode for this channel
			io_timer_set_dshot_capture_mode(timer_index, timer_channel_index, _dshot_frequency);
			io_timer_capture_dma_req(timer_index, timer_channel_index, true);

			// Choose which CC register for this DMA stream
			uint32_t periph_addr = io_timers[timer_index].base + STM32_GTIM_CCR1_OFFSET + (4 * timer_channel_index);

			// Setup DMA for this channel
			px4_stm32_dmasetup(timer_configs[timer_index].dma_ch_handle[timer_channel_index],
					   periph_addr,
					   (uint32_t) dshot_capture_buffer[timer_channel_index],
					   CHANNEL_CAPTURE_BUFF_SIZE,
					   DSHOT_BIDIRECTIONAL_DMA_SCR);

			// NOTE: we can't use DMA callback since GCR encoding creates a variable length pulse train. Instead
			// we use an hrt callback to schedule the processing of the received and DMAd eRPM frames.
			stm32_dmastart(timer_configs[timer_index].dma_ch_handle[timer_channel_index], NULL, NULL, false);
		}
	}

	// Enable CaptureDMA and on all configured channels
	io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, IO_TIMER_ALL_MODES_CHANNELS);

	// 30us to switch regardless of DShot frequency + eRPM frame time + 10us for good measure
	hrt_abstime frame_us = (16 * 1000000) / _dshot_frequency; // 16 bits * us_per_s / bits_per_s
	hrt_abstime delay = 30 + frame_us + 10;

	// Only call this on the first one.
	if (timer_index == 0) {
		hrt_call_after(&_cc_call, delay, capture_complete_callback, NULL);
	}
}

static void capture_complete_callback(void *arg)
{
	(void)arg;
	//uint8_t timer_index = *((uint8_t *)arg);
	//bool print = (counter % 499 == 0);

	// We use one callback for all captures together. Otherwise, we end up having some sort of race condition
	// between them.

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].initialized) {
			continue;
		}

		//if (print) printf("called, doing timer: %d\n", timer_index);
		// Unallocate the timer as CaptureDMA
		io_timer_unallocate_timer(timer_index);

		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

			if ((timer_channel <= 0) || (timer_channel >= 5)) {
				// invalid channel, only 1 - 4
				continue;
			}

			uint8_t timer_channel_index = timer_channel - 1;
			bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
			bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];
			bool captcomp_enabled = timer_configs[timer_index].captcomp_channels[timer_channel_index];

			if (channel_initialized && this_timer) {

				if (captcomp_enabled) {
					// Disable capture DMA
					io_timer_capture_dma_req(timer_index, timer_channel_index, false);

					//if (print) printf("set to null output %d: timer: %d, channel %d\n", output_channel, timer_index, timer_channel_index);
					if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
						stm32_dmastop(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
						stm32_dmafree(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
						timer_configs[timer_index].dma_ch_handle[timer_channel_index] = NULL;
					}
				}

				io_timer_unallocate_channel(output_channel);
				// Initialize back to DShotInverted to bring IO back to the expected idle state
				io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
			}
		}

